In [2]:
import pandas as pd
import numpy as np

df=pd.read_csv('../data/raw/GlobalLandTemperaturesByCountry.csv')
df

,dt,AverageTemperature,AverageTemperatureUncertainty,Country
0,1743-11-01,4.384,2.294,Åland
1,1743-12-01,NaN,NaN,Åland
2,1744-01-01,NaN,NaN,Åland
3,1744-02-01,NaN,NaN,Åland
4,1744-03-01,NaN,NaN,Åland
...,...,...,...,...
577457,2013-05-01,19.059,1.022,Zimbabwe
577458,2013-06-01,17.613,0.473,Zimbabwe
577459,2013-07-01,17.000,0.453,Zimbabwe
577460,2013-08-01,19.759,0.717,Zimbabwe
577461,2013-09-01,NaN,NaN,Zimbabwe

In [3]:
#checking NaN's
df.isna().sum()

dt                                   0
AverageTemperature               32651
AverageTemperatureUncertainty    31912
Country                              0
dtype: int64

In [4]:
df.isna().sum()/df.shape[0]

dt                               0.000000
AverageTemperature               0.056542
AverageTemperatureUncertainty    0.055263
Country                          0.000000
dtype: float64

In [5]:
#renaming columns
df=df.rename(columns={'dt':'date', 'AverageTemperature': 'average_temperature', 'AverageTemperatureUncertainty': 'average_temperature_unvertainty', 'Country': 'country'})

In [23]:
#changing data type
df['date']=pd.to_datetime(df['date'])

In [25]:
df.dtypes

date                               datetime64[ns]
average_temperature                       float64
average_temperature_unvertainty           float64
country                                    object
dtype: object

In [33]:
df2=df[(df['date'] >= '2000-01-01') & (df['date'] <= '2009-12-01')]

In [34]:
df2.isna().sum()

date                                 0
average_temperature                120
average_temperature_unvertainty      0
country                              0
dtype: int64

In [35]:
df2[df2['average_temperature'].isna()]

,date,average_temperature,average_temperature_unvertainty,country
23024,2000-01-01,NaN,0.571,Antarctica
23025,2000-02-01,NaN,0.555,Antarctica
23026,2000-03-01,NaN,0.526,Antarctica
23027,2000-04-01,NaN,0.639,Antarctica
23028,2000-05-01,NaN,0.639,Antarctica
...,...,...,...,...
23139,2009-08-01,NaN,0.646,Antarctica
23140,2009-09-01,NaN,0.566,Antarctica
23141,2009-10-01,NaN,0.479,Antarctica
23142,2009-11-01,NaN,0.511,Antarctica
23143,2009-12-01,NaN,0.590,Antarctica

In [40]:
df3 = df2[df2['country'] != 'Antarctica']
df3['country'].nunique()

242

In [39]:
df3.to_csv('../data/cleaned/global_temperatures_by_country_2000_2009_cleaned.csv')

In [7]:
#new df with slicing from 1980 to 2012
df1980_2012=df[(df['date'] >= '1980-01-01') & (df['date'] <= '2012-12-01')]
df1980_2012

,date,average_temperature,average_temperature_unvertainty,country
2834,1980-01-01,-4.073,0.518,Åland
2835,1980-02-01,-6.484,0.441,Åland
2836,1980-03-01,-3.947,0.466,Åland
2837,1980-04-01,2.928,0.597,Åland
2838,1980-05-01,6.154,0.241,Åland
...,...,...,...,...
577448,2012-08-01,18.946,1.127,Zimbabwe
577449,2012-09-01,22.609,0.643,Zimbabwe
577450,2012-10-01,23.482,0.574,Zimbabwe
577451,2012-11-01,24.606,0.532,Zimbabwe
577452,2012-12-01,24.111,0.846,Zimbabwe

In [8]:
#checking for nan's
df1980_2012.isna().sum()

date                                 0
average_temperature                396
average_temperature_unvertainty      0
country                              0
dtype: int64

In [18]:
rows_with_missing_values = df1980_2012[df1980_2012.isnull().any(axis=1)]
rows_with_missing_values['country'].unique()

array(['Antarctica'], dtype=object)

In [26]:
df1980_2012_cleaned= df1980_2012[df1980_2012['country'] != 'Antarctica']
df1980_2012_cleaned_noregions = df1980_2012_cleaned[~df1980_2012_cleaned['country'].isin(['Asia', 'Africa', 'North America', 'South America', 'Oceania', 'Europe'])]
df1980_2012_cleaned_noregions

array(['Åland', 'Afghanistan', 'Albania', 'Algeria', 'American Samoa',
       'Andorra', 'Angola', 'Anguilla', 'Antigua And Barbuda',
       'Argentina', 'Armenia', 'Aruba', 'Australia', 'Austria',
       'Azerbaijan', 'Bahamas', 'Bahrain', 'Baker Island', 'Bangladesh',
       'Barbados', 'Belarus', 'Belgium', 'Belize', 'Benin', 'Bhutan',
       'Bolivia', 'Bonaire, Saint Eustatius And Saba',
       'Bosnia And Herzegovina', 'Botswana', 'Brazil',
       'British Virgin Islands', 'Bulgaria', 'Burkina Faso', 'Burma',
       'Burundi', "Côte D'Ivoire", 'Cambodia', 'Cameroon', 'Canada',
       'Cape Verde', 'Cayman Islands', 'Central African Republic', 'Chad',
       'Chile', 'China', 'Christmas Island', 'Colombia', 'Comoros',
       'Congo (Democratic Republic Of The)', 'Congo', 'Costa Rica',
       'Croatia', 'Cuba', 'Curaçao', 'Cyprus', 'Czech Republic',
       'Denmark (Europe)', 'Denmark', 'Djibouti', 'Dominica',
       'Dominican Republic', 'Ecuador', 'Egypt', 'El Salvador',
       'Equatorial Guinea', 'Eritrea', 'Estonia', 'Ethiopia',
       'Falkland Islands (Islas Malvinas)', 'Faroe Islands',
       'Federated States Of Micronesia', 'Fiji', 'Finland',
       'France (Europe)', 'France', 'French Guiana', 'French Polynesia',
       'French Southern And Antarctic Lands', 'Gabon', 'Gambia',
       'Gaza Strip', 'Georgia', 'Germany', 'Ghana', 'Greece', 'Greenland',
       'Grenada', 'Guadeloupe', 'Guam', 'Guatemala', 'Guernsey',
       'Guinea Bissau', 'Guinea', 'Guyana', 'Haiti',
       'Heard Island And Mcdonald Islands', 'Honduras', 'Hong Kong',
       'Hungary', 'Iceland', 'India', 'Indonesia', 'Iran', 'Iraq',
       'Ireland', 'Isle Of Man', 'Israel', 'Italy', 'Jamaica', 'Japan',
       'Jersey', 'Jordan', 'Kazakhstan', 'Kenya', 'Kingman Reef',
       'Kiribati', 'Kuwait', 'Kyrgyzstan', 'Laos', 'Latvia', 'Lebanon',
       'Lesotho', 'Liberia', 'Libya', 'Liechtenstein', 'Lithuania',
       'Luxembourg', 'Macau', 'Macedonia', 'Madagascar', 'Malawi',
       'Malaysia', 'Mali', 'Malta', 'Martinique', 'Mauritania',
       'Mauritius', 'Mayotte', 'Mexico', 'Moldova', 'Monaco', 'Mongolia',
       'Montenegro', 'Montserrat', 'Morocco', 'Mozambique', 'Namibia',
       'Nepal', 'Netherlands (Europe)', 'Netherlands', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Niue',
       'North Korea', 'Northern Mariana Islands', 'Norway', 'Oman',
       'Pakistan', 'Palau', 'Palestina', 'Palmyra Atoll', 'Panama',
       'Papua New Guinea', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Qatar', 'Reunion', 'Romania', 'Russia',
       'Rwanda', 'Saint Barthélemy', 'Saint Kitts And Nevis',
       'Saint Lucia', 'Saint Martin', 'Saint Pierre And Miquelon',
       'Saint Vincent And The Grenadines', 'Samoa', 'San Marino',
       'Sao Tome And Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Seychelles', 'Sierra Leone', 'Singapore', 'Sint Maarten',
       'Slovakia', 'Slovenia', 'Solomon Islands', 'Somalia',
       'South Africa', 'South Georgia And The South Sandwich Isla',
       'South Korea', 'Spain', 'Sri Lanka', 'Sudan', 'Suriname',
       'Svalbard And Jan Mayen', 'Swaziland', 'Sweden', 'Switzerland',
       'Syria', 'Taiwan', 'Tajikistan', 'Tanzania', 'Thailand',
       'Timor Leste', 'Togo', 'Tonga', 'Trinidad And Tobago', 'Tunisia',
       'Turkey', 'Turkmenistan', 'Turks And Caicas Islands', 'Uganda',
       'Ukraine', 'United Arab Emirates', 'United Kingdom (Europe)',
       'United Kingdom', 'United States', 'Uruguay', 'Uzbekistan',
       'Venezuela', 'Vietnam', 'Virgin Islands', 'Western Sahara',
       'Yemen', 'Zambia', 'Zimbabwe'], dtype=object)

In [27]:
df1980_2012_cleaned_noregions.to_csv("global_temperatures_by_country_1980_2012_cleaned.csv")

In [36]:
missing_values=df[df['average_temperature'].isna()]
missing_values.unique()

AttributeError: 'DataFrame' object has no attribute 'unique'